openfoam/tutorials/heatTransfer/buoyantPimpleFoam/hotRoomWithThermalShell/system/faSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         none;
    grad(jouleHeatingSource:V_ceilingShell) Gauss linear;
}

divSchemes
{
    default         none;
}

laplacianSchemes
{
    default         none;
    laplacian((h_ceilingShell*jouleHeatingSource:sigma_ceilingShell),jouleHeatingSource:V_ceilingShell) Gauss linear corrected;
    laplacian((kappas*h_ceilingShell),Ts_ceilingShell) Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

lnGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
